MyHome/src/DataProcessors/ЗагрузкаБанковскихВыписок/ЗагрузкаБанковскихВыписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаБанковскихВыписок</name>
  <attributes>
    <name>ФайлДляЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыЗагрузкиБанковскихВыписок</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьСоответствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеВыписки</name>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МСС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДляСозданияДокументов</name>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходовРасходов</name>
      <type>
        <types>String</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <type>
        <types>Characteristic.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <types>DocumentRef.РегистрацияРасходов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

MyHome/src/InformationRegisters/СоответствиеКатегорийИОписанийСтатьямЗатрат/СоответствиеКатегорийИОписанийСтатьямЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеКатегорийИОписанийСтатьямЗатрат</name>
  <resources>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MyHome/src/Enums/ВидыДвиженийДенежныхСредств/ВидыДвиженийДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийДенежныхСредств</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
</mdclass:Enum>

MyHome/src/Documents/РегистрацияРасходов/РегистрацияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияРасходов</name>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>ИсточникОплаты</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/DataProcessors/ЗагрузкаБанковскихВыписок/ObjectModule.bsl
Процедура ЗаполнитьТаблицуСозданияДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеВыписки", ДанныеВыписки.Выгрузить());
	Запрос.УстановитьПараметр("Доход", Перечисления.ВидыДвиженийДенежныхСредств.Доход);
	Запрос.УстановитьПараметр("Расход", Перечисления.ВидыДвиженийДенежныхСредств.Расход);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеВыписки.ДатаОперации,
	|	ДанныеВыписки.ИдентификаторКарты,
	|	ДанныеВыписки.СуммаПлатежа,
	|	ДанныеВыписки.Категория,
	|	ДанныеВыписки.Описание
	|ПОМЕСТИТЬ ДанныеВыписки
	|ИЗ
	|	&ДанныеВыписки КАК ДанныеВыписки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Обрабатывать,
	|	ДанныеВыписки.ДатаОперации КАК ДатаОперации,
	|	КошелькиИСчета.Ссылка КАК Кошелек,
	|	СоответствиеКатегорийИОписанийСтатьямЗатрат.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	СоответствиеКатегорийИОписанийСтатьямЗатрат.АналитикаДоходов КАК АналитикаДоходов,
	|	СоответствиеКатегорийИОписанийСтатьямЗатрат.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеВыписки.СуммаПлатежа КАК Сумма,
	|	ДанныеВыписки.Описание КАК Содержание,
	|	ВЫБОР
	|		КОГДА ДанныеВыписки.СуммаПлатежа > 0
	|			ТОГДА &Доход
	|		ИНАЧЕ &Расход
	|	КОНЕЦ КАК ВидДвижения,
	|	ДанныеВыписки.Категория,
	|	ДанныеВыписки.Описание
	|ИЗ
	|	ДанныеВыписки КАК ДанныеВыписки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КошелькиИСчета КАК КошелькиИСчета
	|		ПО ДанныеВыписки.ИдентификаторКарты = КошелькиИСчета.ИдентификаторКошелька
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеКатегорийИОписанийСтатьямЗатрат КАК
	|			СоответствиеКатегорийИОписанийСтатьямЗатрат
	|		ПО ДанныеВыписки.Категория = СоответствиеКатегорийИОписанийСтатьямЗатрат.Категория
	|		И ДанныеВыписки.Описание = СоответствиеКатегорийИОписанийСтатьямЗатрат.Описание";
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДляСозданияДокументов.Загрузить(ТаблицаДанных);
	
КонецПроцедуры

Процедура СформироватьДокументы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДляСозданияДокументов.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.Обрабатывать,
	|	ТаблицаДанных.Кошелек,
	|	ТаблицаДанных.СтатьяДоходовРасходов,
	|	ТаблицаДанных.АналитикаДоходов,
	|	ТаблицаДанных.АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДанных.Сумма < 0
	|			ТОГДА -ТаблицаДанных.Сумма
	|		ИНАЧЕ ТаблицаДанных.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ТаблицаДанных.Содержание,
	|	ТаблицаДанных.Категория,
	|	ТаблицаДанных.Описание,
	|	ТаблицаДанных.ВидДвижения,
	|	ТаблицаДанных.ДатаОперации
	|ПОМЕСТИТЬ ТаблицаДанных
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.Обрабатывать,
	|	ТаблицаДанных.Кошелек,
	|	ТаблицаДанных.СтатьяДоходовРасходов,
	|	ТаблицаДанных.АналитикаДоходов,
	|	ТаблицаДанных.АналитикаРасходов,
	|	ТаблицаДанных.Сумма,
	|	ТаблицаДанных.Содержание,
	|	ТаблицаДанных.ВидДвижения КАК ВидДвижения,
	|	ТаблицаДанных.Категория,
	|	ТаблицаДанных.Описание,
	|	ТаблицаДанных.ДатаОперации
	|ИЗ
	|	ТаблицаДанных КАК ТаблицаДанных
	|ГДЕ
	|	ТаблицаДанных.Обрабатывать
	|ИТОГИ
	|ПО
	|	ВидДвижения";
	
	ВыборкаПоВидамДвижений = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоВидамДвижений.Следующий() Цикл
		
		Результат = СоздатьДокументДвиженияДС(ВыборкаПоВидамДвижений);
		
		НоваяСтрока = СозданныеДокументы.Добавить();
		НоваяСтрока.Документ = Результат.Документ;
		
	КонецЦикла;
	
	Если СохранитьСоответствия Тогда
		ВыборкаПоВидамДвижений.Сбросить();
		СохранитьСоответствияКатегорийИСтатейЗатрат(ВыборкаПоВидамДвижений);
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьСоответствияКатегорийИСтатейЗатрат(ВыборкаПоВидамДвижений)	
	
	Пока ВыборкаПоВидамДвижений.Следующий() Цикл
		
		ВыборкаПоСтрокам = ВыборкаПоВидамДвижений.Выбрать();
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			Если ПустаяСтрока(ВыборкаПоСтрокам.Категория)
				И ПустаяСтрока(ВыборкаПоСтрокам.Описание) Тогда					
				Продолжить;				
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.СоответствиеКатегорийИОписанийСтатьямЗатрат.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаПоСтрокам);
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьДокументДвиженияДС(ВыборкаПоВидамДвижений)

	ВидДвижения = ВыборкаПоВидамДвижений.ВидДвижения;
	
	Если ВидДвижения = Перечисления.ВидыДвиженийДенежныхСредств.Расход Тогда
		Возврат СоздатьДокументРасхода(ВыборкаПоВидамДвижений);
	Иначе
		ВызватьИсключение "Необрабатываемый вид движения: " + ВидДвижения; 
	КонецЕсли;

КонецФункции

Функция СоздатьДокументРасхода(ВыборкаПоВидамДвижений)
	
	Результат = Новый Структура("Успех, Документ, ОписаниеОшибки", Ложь, Неопределено, "");
	
	ДокументРасхода = Документы.РегистрацияРасходов.СоздатьДокумент();
	ДокументРасхода.Дата = ТекущаяДата();
	
	ВыборкаПоРасходам = ВыборкаПоВидамДвижений.Выбрать();
	
	Пока ВыборкаПоРасходам.Следующий() Цикл
		
		НоваяСтрока = ДокументРасхода.Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоРасходам);
		НоваяСтрока.ИсточникОплаты = ВыборкаПоРасходам.Кошелек;
		НоваяСтрока.СтатьяРасходов = ВыборкаПоРасходам.СтатьяДоходовРасходов;
		НоваяСтрока.ДатаРасхода = ВыборкаПоРасходам.ДатаОперации;
		
	КонецЦикла;
	
	Попытка
		ДокументРасхода.Записать(РежимЗаписиДокумента.Проведение);
		Результат.Успех = Истина;
		Результат.Документ = ДокументРасхода.Ссылка;
	Исключение
		Результат.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;

КонецФункции
